Model: "till_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
res_block (ResBlock)         (None, 500, 500, 8)       1928      
_________________________________________________________________
res_block_1 (ResBlock)       (None, 250, 250, 16)      8320      
_________________________________________________________________
padder (Padder)              (None, 256, 256, 16)      0         
_________________________________________________________________
res_block_2 (ResBlock)       (None, 128, 128, 32)      32768     
_________________________________________________________________
res_block_3 (ResBlock)       (None, 64, 64, 32)        37376     
_________________________________________________________________
res_block_4 (ResBlock)       (None, 32, 32, 32)        37376     
_________________________________________________________________
res_block_5 (ResBlock)       (None, 16, 16, 32)        37376     
_________________________________________________________________
res_block_6 (ResBlock)       (None, 8, 8, 32)          37376     
_________________________________________________________________
res_block_7 (ResBlock)       (None, 4, 4, 32)          37376     
_________________________________________________________________
flatten (Flatten)            (None, 512)               0         
_________________________________________________________________
dropout (Dropout)            (None, 512)               0         
_________________________________________________________________
dense (Dense)                (None, 1)                 512       
=================================================================
Total params: 230,408
Trainable params: 228,680
Non-trainable params: 1,728
_________________________________________________________________
 res_block summary:Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 500, 500, 8)       72        
_________________________________________________________________
batch_normalization_v2 (Batc (None, 500, 500, 8)       32        
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 500, 500, 8)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 500, 500, 8)       576       
_________________________________________________________________
batch_normalization_v2_1 (Ba (None, 500, 500, 8)       32        
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 500, 500, 8)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 500, 500, 8)       576       
_________________________________________________________________
batch_normalization_v2_2 (Ba (None, 500, 500, 8)       32        
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 500, 500, 8)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 500, 500, 8)       576       
_________________________________________________________________
batch_normalization_v2_3 (Ba (None, 500, 500, 8)       32        
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 500, 500, 8)       0         
=================================================================
Total params: 1,928
Trainable params: 1,864
Non-trainable params: 64
_________________________________________________________________
 res_block_1 summary:Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_4 (Conv2D)            (None, 250, 250, 16)      1152      
_________________________________________________________________
batch_normalization_v2_4 (Ba (None, 250, 250, 16)      64        
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 250, 250, 16)      0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 250, 250, 16)      2304      
_________________________________________________________________
batch_normalization_v2_5 (Ba (None, 250, 250, 16)      64        
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 250, 250, 16)      0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 250, 250, 16)      2304      
_________________________________________________________________
batch_normalization_v2_6 (Ba (None, 250, 250, 16)      64        
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 250, 250, 16)      0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 250, 250, 16)      2304      
_________________________________________________________________
batch_normalization_v2_7 (Ba (None, 250, 250, 16)      64        
_________________________________________________________________
leaky_re_lu_7 (LeakyReLU)    (None, 250, 250, 16)      0         
=================================================================
Total params: 8,320
Trainable params: 8,192
Non-trainable params: 128
_________________________________________________________________
 res_block_2 summary:Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_8 (Conv2D)            (None, 128, 128, 32)      4608      
_________________________________________________________________
batch_normalization_v2_8 (Ba (None, 128, 128, 32)      128       
_________________________________________________________________
leaky_re_lu_8 (LeakyReLU)    (None, 128, 128, 32)      0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 128, 128, 32)      9216      
_________________________________________________________________
batch_normalization_v2_9 (Ba (None, 128, 128, 32)      128       
_________________________________________________________________
leaky_re_lu_9 (LeakyReLU)    (None, 128, 128, 32)      0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 128, 128, 32)      9216      
_________________________________________________________________
batch_normalization_v2_10 (B (None, 128, 128, 32)      128       
_________________________________________________________________
leaky_re_lu_10 (LeakyReLU)   (None, 128, 128, 32)      0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 128, 128, 32)      9216      
_________________________________________________________________
batch_normalization_v2_11 (B (None, 128, 128, 32)      128       
_________________________________________________________________
leaky_re_lu_11 (LeakyReLU)   (None, 128, 128, 32)      0         
=================================================================
Total params: 32,768
Trainable params: 32,512
Non-trainable params: 256
_________________________________________________________________
 res_block_3 summary:Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_12 (Conv2D)           (None, 64, 64, 32)        9216      
_________________________________________________________________
batch_normalization_v2_12 (B (None, 64, 64, 32)        128       
_________________________________________________________________
leaky_re_lu_12 (LeakyReLU)   (None, 64, 64, 32)        0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 64, 64, 32)        9216      
_________________________________________________________________
batch_normalization_v2_13 (B (None, 64, 64, 32)        128       
_________________________________________________________________
leaky_re_lu_13 (LeakyReLU)   (None, 64, 64, 32)        0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 64, 64, 32)        9216      
_________________________________________________________________
batch_normalization_v2_14 (B (None, 64, 64, 32)        128       
_________________________________________________________________
leaky_re_lu_14 (LeakyReLU)   (None, 64, 64, 32)        0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 64, 64, 32)        9216      
_________________________________________________________________
batch_normalization_v2_15 (B (None, 64, 64, 32)        128       
_________________________________________________________________
leaky_re_lu_15 (LeakyReLU)   (None, 64, 64, 32)        0         
=================================================================
Total params: 37,376
Trainable params: 37,120
Non-trainable params: 256
_________________________________________________________________
 res_block_4 summary:Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_16 (Conv2D)           (None, 32, 32, 32)        9216      
_________________________________________________________________
batch_normalization_v2_16 (B (None, 32, 32, 32)        128       
_________________________________________________________________
leaky_re_lu_16 (LeakyReLU)   (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 32, 32, 32)        9216      
_________________________________________________________________
batch_normalization_v2_17 (B (None, 32, 32, 32)        128       
_________________________________________________________________
leaky_re_lu_17 (LeakyReLU)   (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 32, 32, 32)        9216      
_________________________________________________________________
batch_normalization_v2_18 (B (None, 32, 32, 32)        128       
_________________________________________________________________
leaky_re_lu_18 (LeakyReLU)   (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 32, 32, 32)        9216      
_________________________________________________________________
batch_normalization_v2_19 (B (None, 32, 32, 32)        128       
_________________________________________________________________
leaky_re_lu_19 (LeakyReLU)   (None, 32, 32, 32)        0         
=================================================================
Total params: 37,376
Trainable params: 37,120
Non-trainable params: 256
_________________________________________________________________
 res_block_5 summary:Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_20 (Conv2D)           (None, 16, 16, 32)        9216      
_________________________________________________________________
batch_normalization_v2_20 (B (None, 16, 16, 32)        128       
_________________________________________________________________
leaky_re_lu_20 (LeakyReLU)   (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 16, 16, 32)        9216      
_________________________________________________________________
batch_normalization_v2_21 (B (None, 16, 16, 32)        128       
_________________________________________________________________
leaky_re_lu_21 (LeakyReLU)   (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 16, 16, 32)        9216      
_________________________________________________________________
batch_normalization_v2_22 (B (None, 16, 16, 32)        128       
_________________________________________________________________
leaky_re_lu_22 (LeakyReLU)   (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 16, 16, 32)        9216      
_________________________________________________________________
batch_normalization_v2_23 (B (None, 16, 16, 32)        128       
_________________________________________________________________
leaky_re_lu_23 (LeakyReLU)   (None, 16, 16, 32)        0         
=================================================================
Total params: 37,376
Trainable params: 37,120
Non-trainable params: 256
_________________________________________________________________
 res_block_6 summary:Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_24 (Conv2D)           (None, 8, 8, 32)          9216      
_________________________________________________________________
batch_normalization_v2_24 (B (None, 8, 8, 32)          128       
_________________________________________________________________
leaky_re_lu_24 (LeakyReLU)   (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_25 (Conv2D)           (None, 8, 8, 32)          9216      
_________________________________________________________________
batch_normalization_v2_25 (B (None, 8, 8, 32)          128       
_________________________________________________________________
leaky_re_lu_25 (LeakyReLU)   (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_26 (Conv2D)           (None, 8, 8, 32)          9216      
_________________________________________________________________
batch_normalization_v2_26 (B (None, 8, 8, 32)          128       
_________________________________________________________________
leaky_re_lu_26 (LeakyReLU)   (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_27 (Conv2D)           (None, 8, 8, 32)          9216      
_________________________________________________________________
batch_normalization_v2_27 (B (None, 8, 8, 32)          128       
_________________________________________________________________
leaky_re_lu_27 (LeakyReLU)   (None, 8, 8, 32)          0         
=================================================================
Total params: 37,376
Trainable params: 37,120
Non-trainable params: 256
_________________________________________________________________
 res_block_7 summary:Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_28 (Conv2D)           (None, 4, 4, 32)          9216      
_________________________________________________________________
batch_normalization_v2_28 (B (None, 4, 4, 32)          128       
_________________________________________________________________
leaky_re_lu_28 (LeakyReLU)   (None, 4, 4, 32)          0         
_________________________________________________________________
conv2d_29 (Conv2D)           (None, 4, 4, 32)          9216      
_________________________________________________________________
batch_normalization_v2_29 (B (None, 4, 4, 32)          128       
_________________________________________________________________
leaky_re_lu_29 (LeakyReLU)   (None, 4, 4, 32)          0         
_________________________________________________________________
conv2d_30 (Conv2D)           (None, 4, 4, 32)          9216      
_________________________________________________________________
batch_normalization_v2_30 (B (None, 4, 4, 32)          128       
_________________________________________________________________
leaky_re_lu_30 (LeakyReLU)   (None, 4, 4, 32)          0         
_________________________________________________________________
conv2d_31 (Conv2D)           (None, 4, 4, 32)          9216      
_________________________________________________________________
batch_normalization_v2_31 (B (None, 4, 4, 32)          128       
_________________________________________________________________
leaky_re_lu_31 (LeakyReLU)   (None, 4, 4, 32)          0         
=================================================================
Total params: 37,376
Trainable params: 37,120
Non-trainable params: 256
_________________________________________________________________
