Model: "till_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 500, 500, 32)      288       
_________________________________________________________________
batch_normalization_v2 (Batc (None, 500, 500, 32)      128       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 500, 500, 32)      0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 250, 250, 64)      18432     
_________________________________________________________________
batch_normalization_v2_1 (Ba (None, 250, 250, 64)      256       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 250, 250, 64)      0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 125, 125, 128)     73728     
_________________________________________________________________
batch_normalization_v2_2 (Ba (None, 125, 125, 128)     512       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 125, 125, 128)     0         
_________________________________________________________________
padder (Padder)              (None, 128, 128, 128)     0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 64, 64, 256)       294912    
_________________________________________________________________
batch_normalization_v2_3 (Ba (None, 64, 64, 256)       1024      
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 64, 64, 256)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 32, 32, 256)       589824    
_________________________________________________________________
batch_normalization_v2_4 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 32, 32, 256)       0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 16, 16, 256)       589824    
_________________________________________________________________
batch_normalization_v2_5 (Ba (None, 16, 16, 256)       1024      
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 16, 16, 256)       0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 8, 8, 256)         589824    
_________________________________________________________________
batch_normalization_v2_6 (Ba (None, 8, 8, 256)         1024      
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 8, 8, 256)         0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 4, 4, 256)         589824    
_________________________________________________________________
batch_normalization_v2_7 (Ba (None, 4, 4, 256)         1024      
_________________________________________________________________
leaky_re_lu_7 (LeakyReLU)    (None, 4, 4, 256)         0         
_________________________________________________________________
flatten (Flatten)            (None, 4096)              0         
_________________________________________________________________
dense (Dense)                (None, 1)                 4097      
_________________________________________________________________
sigmoid_layer (SigmoidLayer) (None, 1)                 0         
_________________________________________________________________
factor_layer (FactorLayer)   (None, 1)                 0         
=================================================================
Total params: 2,756,769
Trainable params: 2,753,761
Non-trainable params: 3,008
_________________________________________________________________
