Model: "till_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
res_block (ResBlock)         (None, 125, 125, 4)       228       
_________________________________________________________________
padder (Padder)              (None, 128, 128, 4)       0         
_________________________________________________________________
res_block_1 (ResBlock)       (None, 64, 64, 8)         1056      
_________________________________________________________________
res_block_2 (ResBlock)       (None, 32, 32, 16)        4096      
_________________________________________________________________
res_block_3 (ResBlock)       (None, 16, 16, 32)        16128     
_________________________________________________________________
res_block_4 (ResBlock)       (None, 8, 8, 32)          22784     
_________________________________________________________________
res_block_5 (ResBlock)       (None, 4, 4, 32)          22784     
_________________________________________________________________
flatten (Flatten)            (None, 512)               0         
_________________________________________________________________
dropout (Dropout)            (None, 512)               0         
_________________________________________________________________
dense (Dense)                (None, 1)                 512       
=================================================================
Total params: 67,588
Trainable params: 67,092
Non-trainable params: 496
_________________________________________________________________
 res_block summary:Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 125, 125, 4)       36        
_________________________________________________________________
batch_normalization_v2 (Batc (None, 125, 125, 4)       16        
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 125, 125, 4)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 125, 125, 4)       144       
_________________________________________________________________
batch_normalization_v2_1 (Ba (None, 125, 125, 4)       16        
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 125, 125, 4)       0         
=================================================================
Total params: 212
Trainable params: 196
Non-trainable params: 16
_________________________________________________________________
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_2 (Conv2D)            (None, 125, 125, 4)       16        
=================================================================
Total params: 16
Trainable params: 16
Non-trainable params: 0
_________________________________________________________________
 res_block_1 summary:Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_3 (Conv2D)            (None, 64, 64, 8)         288       
_________________________________________________________________
batch_normalization_v2_2 (Ba (None, 64, 64, 8)         32        
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 64, 64, 8)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 64, 64, 8)         576       
_________________________________________________________________
batch_normalization_v2_3 (Ba (None, 64, 64, 8)         32        
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 64, 64, 8)         0         
=================================================================
Total params: 928
Trainable params: 896
Non-trainable params: 32
_________________________________________________________________
Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_5 (Conv2D)            (None, 64, 64, 8)         128       
=================================================================
Total params: 128
Trainable params: 128
Non-trainable params: 0
_________________________________________________________________
 res_block_2 summary:Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_6 (Conv2D)            (None, 32, 32, 16)        1152      
_________________________________________________________________
batch_normalization_v2_4 (Ba (None, 32, 32, 16)        64        
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 32, 32, 16)        2304      
_________________________________________________________________
batch_normalization_v2_5 (Ba (None, 32, 32, 16)        64        
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 32, 32, 16)        0         
=================================================================
Total params: 3,584
Trainable params: 3,520
Non-trainable params: 64
_________________________________________________________________
Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_8 (Conv2D)            (None, 32, 32, 16)        512       
=================================================================
Total params: 512
Trainable params: 512
Non-trainable params: 0
_________________________________________________________________
 res_block_3 summary:Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_9 (Conv2D)            (None, 16, 16, 32)        4608      
_________________________________________________________________
batch_normalization_v2_6 (Ba (None, 16, 16, 32)        128       
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 16, 16, 32)        9216      
_________________________________________________________________
batch_normalization_v2_7 (Ba (None, 16, 16, 32)        128       
_________________________________________________________________
leaky_re_lu_7 (LeakyReLU)    (None, 16, 16, 32)        0         
=================================================================
Total params: 14,080
Trainable params: 13,952
Non-trainable params: 128
_________________________________________________________________
Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_11 (Conv2D)           (None, 16, 16, 32)        2048      
=================================================================
Total params: 2,048
Trainable params: 2,048
Non-trainable params: 0
_________________________________________________________________
 res_block_4 summary:Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_12 (Conv2D)           (None, 8, 8, 32)          9216      
_________________________________________________________________
batch_normalization_v2_8 (Ba (None, 8, 8, 32)          128       
_________________________________________________________________
leaky_re_lu_8 (LeakyReLU)    (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 8, 8, 32)          9216      
_________________________________________________________________
batch_normalization_v2_9 (Ba (None, 8, 8, 32)          128       
_________________________________________________________________
leaky_re_lu_9 (LeakyReLU)    (None, 8, 8, 32)          0         
=================================================================
Total params: 18,688
Trainable params: 18,560
Non-trainable params: 128
_________________________________________________________________
Model: "sequential_9"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_14 (Conv2D)           (None, 8, 8, 32)          4096      
=================================================================
Total params: 4,096
Trainable params: 4,096
Non-trainable params: 0
_________________________________________________________________
 res_block_5 summary:Model: "sequential_10"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_15 (Conv2D)           (None, 4, 4, 32)          9216      
_________________________________________________________________
batch_normalization_v2_10 (B (None, 4, 4, 32)          128       
_________________________________________________________________
leaky_re_lu_10 (LeakyReLU)   (None, 4, 4, 32)          0         
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 4, 4, 32)          9216      
_________________________________________________________________
batch_normalization_v2_11 (B (None, 4, 4, 32)          128       
_________________________________________________________________
leaky_re_lu_11 (LeakyReLU)   (None, 4, 4, 32)          0         
=================================================================
Total params: 18,688
Trainable params: 18,560
Non-trainable params: 128
_________________________________________________________________
Model: "sequential_11"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_17 (Conv2D)           (None, 4, 4, 32)          4096      
=================================================================
Total params: 4,096
Trainable params: 4,096
Non-trainable params: 0
_________________________________________________________________
