Model: "till_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
padder (Padder)              (None, 128, 128, 1)       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 64, 64, 8)         72        
_________________________________________________________________
batch_normalization_v2 (Batc (None, 64, 64, 8)         32        
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 64, 64, 8)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 32, 32, 16)        1152      
_________________________________________________________________
batch_normalization_v2_1 (Ba (None, 32, 32, 16)        64        
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 16, 16, 32)        4608      
_________________________________________________________________
batch_normalization_v2_2 (Ba (None, 16, 16, 32)        128       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 8, 8, 64)          18432     
_________________________________________________________________
batch_normalization_v2_3 (Ba (None, 8, 8, 64)          256       
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 4, 4, 64)          36864     
_________________________________________________________________
batch_normalization_v2_4 (Ba (None, 4, 4, 64)          256       
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 4, 4, 64)          0         
_________________________________________________________________
flatten (Flatten)            (None, 1024)              0         
_________________________________________________________________
dense (Dense)                (None, 1)                 1025      
_________________________________________________________________
sigmoid_layer (SigmoidLayer) (None, 1)                 0         
_________________________________________________________________
factor_layer (FactorLayer)   (None, 1)                 0         
=================================================================
Total params: 62,889
Trainable params: 62,521
Non-trainable params: 368
_________________________________________________________________
