Model: "till_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
res_block (ResBlock)         (None, 125, 125, 4)       388       
_________________________________________________________________
padder (Padder)              (None, 128, 128, 4)       0         
_________________________________________________________________
res_block_1 (ResBlock)       (None, 64, 64, 8)         1664      
_________________________________________________________________
res_block_2 (ResBlock)       (None, 32, 32, 16)        6464      
_________________________________________________________________
res_block_3 (ResBlock)       (None, 16, 16, 32)        25472     
_________________________________________________________________
res_block_4 (ResBlock)       (None, 8, 8, 32)          32128     
_________________________________________________________________
res_block_5 (ResBlock)       (None, 4, 4, 32)          32128     
_________________________________________________________________
flatten (Flatten)            (None, 512)               0         
_________________________________________________________________
dropout (Dropout)            (None, 512)               0         
_________________________________________________________________
dense (Dense)                (None, 1)                 512       
=================================================================
Total params: 98,756
Trainable params: 98,012
Non-trainable params: 744
_________________________________________________________________
 res_block summary:Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 125, 125, 4)       36        
_________________________________________________________________
batch_normalization_v2 (Batc (None, 125, 125, 4)       16        
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 125, 125, 4)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 125, 125, 4)       144       
_________________________________________________________________
batch_normalization_v2_1 (Ba (None, 125, 125, 4)       16        
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 125, 125, 4)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 125, 125, 4)       144       
_________________________________________________________________
batch_normalization_v2_2 (Ba (None, 125, 125, 4)       16        
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 125, 125, 4)       0         
=================================================================
Total params: 372
Trainable params: 348
Non-trainable params: 24
_________________________________________________________________
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_3 (Conv2D)            (None, 125, 125, 4)       16        
=================================================================
Total params: 16
Trainable params: 16
Non-trainable params: 0
_________________________________________________________________
 res_block_1 summary:Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_4 (Conv2D)            (None, 64, 64, 8)         288       
_________________________________________________________________
batch_normalization_v2_3 (Ba (None, 64, 64, 8)         32        
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 64, 64, 8)         0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 64, 64, 8)         576       
_________________________________________________________________
batch_normalization_v2_4 (Ba (None, 64, 64, 8)         32        
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 64, 64, 8)         0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 64, 64, 8)         576       
_________________________________________________________________
batch_normalization_v2_5 (Ba (None, 64, 64, 8)         32        
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 64, 64, 8)         0         
=================================================================
Total params: 1,536
Trainable params: 1,488
Non-trainable params: 48
_________________________________________________________________
Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_7 (Conv2D)            (None, 64, 64, 8)         128       
=================================================================
Total params: 128
Trainable params: 128
Non-trainable params: 0
_________________________________________________________________
 res_block_2 summary:Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_8 (Conv2D)            (None, 32, 32, 16)        1152      
_________________________________________________________________
batch_normalization_v2_6 (Ba (None, 32, 32, 16)        64        
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 32, 32, 16)        2304      
_________________________________________________________________
batch_normalization_v2_7 (Ba (None, 32, 32, 16)        64        
_________________________________________________________________
leaky_re_lu_7 (LeakyReLU)    (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 32, 32, 16)        2304      
_________________________________________________________________
batch_normalization_v2_8 (Ba (None, 32, 32, 16)        64        
_________________________________________________________________
leaky_re_lu_8 (LeakyReLU)    (None, 32, 32, 16)        0         
=================================================================
Total params: 5,952
Trainable params: 5,856
Non-trainable params: 96
_________________________________________________________________
Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_11 (Conv2D)           (None, 32, 32, 16)        512       
=================================================================
Total params: 512
Trainable params: 512
Non-trainable params: 0
_________________________________________________________________
 res_block_3 summary:Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_12 (Conv2D)           (None, 16, 16, 32)        4608      
_________________________________________________________________
batch_normalization_v2_9 (Ba (None, 16, 16, 32)        128       
_________________________________________________________________
leaky_re_lu_9 (LeakyReLU)    (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 16, 16, 32)        9216      
_________________________________________________________________
batch_normalization_v2_10 (B (None, 16, 16, 32)        128       
_________________________________________________________________
leaky_re_lu_10 (LeakyReLU)   (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 16, 16, 32)        9216      
_________________________________________________________________
batch_normalization_v2_11 (B (None, 16, 16, 32)        128       
_________________________________________________________________
leaky_re_lu_11 (LeakyReLU)   (None, 16, 16, 32)        0         
=================================================================
Total params: 23,424
Trainable params: 23,232
Non-trainable params: 192
_________________________________________________________________
Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_15 (Conv2D)           (None, 16, 16, 32)        2048      
=================================================================
Total params: 2,048
Trainable params: 2,048
Non-trainable params: 0
_________________________________________________________________
 res_block_4 summary:Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_16 (Conv2D)           (None, 8, 8, 32)          9216      
_________________________________________________________________
batch_normalization_v2_12 (B (None, 8, 8, 32)          128       
_________________________________________________________________
leaky_re_lu_12 (LeakyReLU)   (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 8, 8, 32)          9216      
_________________________________________________________________
batch_normalization_v2_13 (B (None, 8, 8, 32)          128       
_________________________________________________________________
leaky_re_lu_13 (LeakyReLU)   (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 8, 8, 32)          9216      
_________________________________________________________________
batch_normalization_v2_14 (B (None, 8, 8, 32)          128       
_________________________________________________________________
leaky_re_lu_14 (LeakyReLU)   (None, 8, 8, 32)          0         
=================================================================
Total params: 28,032
Trainable params: 27,840
Non-trainable params: 192
_________________________________________________________________
Model: "sequential_9"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_19 (Conv2D)           (None, 8, 8, 32)          4096      
=================================================================
Total params: 4,096
Trainable params: 4,096
Non-trainable params: 0
_________________________________________________________________
 res_block_5 summary:Model: "sequential_10"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_20 (Conv2D)           (None, 4, 4, 32)          9216      
_________________________________________________________________
batch_normalization_v2_15 (B (None, 4, 4, 32)          128       
_________________________________________________________________
leaky_re_lu_15 (LeakyReLU)   (None, 4, 4, 32)          0         
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 4, 4, 32)          9216      
_________________________________________________________________
batch_normalization_v2_16 (B (None, 4, 4, 32)          128       
_________________________________________________________________
leaky_re_lu_16 (LeakyReLU)   (None, 4, 4, 32)          0         
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 4, 4, 32)          9216      
_________________________________________________________________
batch_normalization_v2_17 (B (None, 4, 4, 32)          128       
_________________________________________________________________
leaky_re_lu_17 (LeakyReLU)   (None, 4, 4, 32)          0         
=================================================================
Total params: 28,032
Trainable params: 27,840
Non-trainable params: 192
_________________________________________________________________
Model: "sequential_11"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_23 (Conv2D)           (None, 4, 4, 32)          4096      
=================================================================
Total params: 4,096
Trainable params: 4,096
Non-trainable params: 0
_________________________________________________________________
