Model: "dis"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 14, 14, 64)   1664        input_1[0][0]                    
__________________________________________________________________________________________________
leaky_re_lu (LeakyReLU)         (None, 14, 14, 64)   0           conv2d[0][0]                     
__________________________________________________________________________________________________
dropout (Dropout)               (None, 14, 14, 64)   0           leaky_re_lu[0][0]                
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 7, 7, 128)    204928      dropout[0][0]                    
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 5)]          0                                            
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 7, 7, 128)    0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
dense (Dense)                   (None, 6272)         37632       input_2[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 7, 7, 128)    0           leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_v2 (BatchNo (None, 6272)         25088       dense[0][0]                      
__________________________________________________________________________________________________
flatten (Flatten)               (None, 6272)         0           dropout_1[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 6272)         0           batch_normalization_v2[0][0]     
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 12544)        0           flatten[0][0]                    
                                                                 leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1)            12545       concatenate[0][0]                
==================================================================================================
Total params: 281,857
Trainable params: 269,313
Non-trainable params: 12,544
__________________________________________________________________________________________________
