Model: "gen"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            [(None, 100)]        0                                            
__________________________________________________________________________________________________
input_4 (InputLayer)            [(None, 5)]          0                                            
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 12544)        1254400     input_3[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 12544)        62720       input_4[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v2_1 (Batch (None, 12544)        50176       dense_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v2_2 (Batch (None, 12544)        50176       dense_3[0][0]                    
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 12544)        0           batch_normalization_v2_1[0][0]   
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 12544)        0           batch_normalization_v2_2[0][0]   
__________________________________________________________________________________________________
reshape (Reshape)               (None, 7, 7, 256)    0           leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 7, 7, 256)    0           leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 7, 7, 512)    0           reshape[0][0]                    
                                                                 reshape_1[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 7, 7, 128)    1638400     concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_v2_3 (Batch (None, 7, 7, 128)    512         conv2d_transpose[0][0]           
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 7, 7, 128)    0           batch_normalization_v2_3[0][0]   
__________________________________________________________________________________________________
up_sampling2d (UpSampling2D)    (None, 14, 14, 128)  0           leaky_re_lu_5[0][0]              
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 14, 14, 64)   204800      up_sampling2d[0][0]              
__________________________________________________________________________________________________
batch_normalization_v2_4 (Batch (None, 14, 14, 64)   256         conv2d_2[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 14, 14, 64)   0           batch_normalization_v2_4[0][0]   
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 28, 28, 64)   0           leaky_re_lu_6[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 28, 28, 1)    1600        up_sampling2d_1[0][0]            
__________________________________________________________________________________________________
activation (Activation)         (None, 28, 28, 1)    0           conv2d_3[0][0]                   
==================================================================================================
Total params: 3,263,040
Trainable params: 3,212,480
Non-trainable params: 50,560
__________________________________________________________________________________________________
