{"class_name": "Sequential", "config": {"name": "till_model", "layers": [{"class_name": "ResBlock", "config": {"name": "res_block", "trainable": true, "batch_input_shape": [null, 1000, 1000, 1], "dtype": "float32", "conf": {"image_size": 1000, "percentage_train": 0.8, "max_elements": 9600, "period_to_save_cp": 5, "num_epochs_for_lin_regression": 40, "tot_num_epochs": 400, "batch_size": 50, "lr": 0.001, "train_loss_type": "MSE", "val_loss_type": "MSE", "rot_range": 0, "use_fft": false, "residual": true, "num_convs_per_block": 2, "num_blocks_per_res": 2, "downsample_factor": 2, "use_max_pool": false, "downsample_with_first_conv": true, "num_dense_layers": 1, "latent_features": 64, "kernel": 3, "features": 4, "max_features": 32, "norm_type": "batch", "min_res": 4, "lrelu_alpha": 0.2, "use_bias": false, "dropout": 0.3, "weight_reg_kind": "l2", "weight_reg_factor": 0}, "downsample": true, "features": 4, "last_features": 1}}, {"class_name": "ResBlock", "config": {"name": "res_block_1", "trainable": true, "batch_input_shape": [null, 1000, 1000, 1], "dtype": "float32", "conf": {"image_size": 1000, "percentage_train": 0.8, "max_elements": 9600, "period_to_save_cp": 5, "num_epochs_for_lin_regression": 40, "tot_num_epochs": 400, "batch_size": 50, "lr": 0.001, "train_loss_type": "MSE", "val_loss_type": "MSE", "rot_range": 0, "use_fft": false, "residual": true, "num_convs_per_block": 2, "num_blocks_per_res": 2, "downsample_factor": 2, "use_max_pool": false, "downsample_with_first_conv": true, "num_dense_layers": 1, "latent_features": 64, "kernel": 3, "features": 4, "max_features": 32, "norm_type": "batch", "min_res": 4, "lrelu_alpha": 0.2, "use_bias": false, "dropout": 0.3, "weight_reg_kind": "l2", "weight_reg_factor": 0}, "downsample": false, "features": 4, "last_features": 1}}, {"class_name": "ResBlock", "config": {"name": "res_block_2", "trainable": true, "batch_input_shape": [null, 500, 500, 4], "dtype": "float32", "conf": {"image_size": 1000, "percentage_train": 0.8, "max_elements": 9600, "period_to_save_cp": 5, "num_epochs_for_lin_regression": 40, "tot_num_epochs": 400, "batch_size": 50, "lr": 0.001, "train_loss_type": "MSE", "val_loss_type": "MSE", "rot_range": 0, "use_fft": false, "residual": true, "num_convs_per_block": 2, "num_blocks_per_res": 2, "downsample_factor": 2, "use_max_pool": false, "downsample_with_first_conv": true, "num_dense_layers": 1, "latent_features": 64, "kernel": 3, "features": 4, "max_features": 32, "norm_type": "batch", "min_res": 4, "lrelu_alpha": 0.2, "use_bias": false, "dropout": 0.3, "weight_reg_kind": "l2", "weight_reg_factor": 0}, "downsample": true, "features": 8, "last_features": 4}}, {"class_name": "ResBlock", "config": {"name": "res_block_3", "trainable": true, "batch_input_shape": [null, 500, 500, 4], "dtype": "float32", "conf": {"image_size": 1000, "percentage_train": 0.8, "max_elements": 9600, "period_to_save_cp": 5, "num_epochs_for_lin_regression": 40, "tot_num_epochs": 400, "batch_size": 50, "lr": 0.001, "train_loss_type": "MSE", "val_loss_type": "MSE", "rot_range": 0, "use_fft": false, "residual": true, "num_convs_per_block": 2, "num_blocks_per_res": 2, "downsample_factor": 2, "use_max_pool": false, "downsample_with_first_conv": true, "num_dense_layers": 1, "latent_features": 64, "kernel": 3, "features": 4, "max_features": 32, "norm_type": "batch", "min_res": 4, "lrelu_alpha": 0.2, "use_bias": false, "dropout": 0.3, "weight_reg_kind": "l2", "weight_reg_factor": 0}, "downsample": false, "features": 8, "last_features": 4}}, {"class_name": "ResBlock", "config": {"name": "res_block_4", "trainable": true, "batch_input_shape": [null, 250, 250, 8], "dtype": "float32", "conf": {"image_size": 1000, "percentage_train": 0.8, "max_elements": 9600, "period_to_save_cp": 5, "num_epochs_for_lin_regression": 40, "tot_num_epochs": 400, "batch_size": 50, "lr": 0.001, "train_loss_type": "MSE", "val_loss_type": "MSE", "rot_range": 0, "use_fft": false, "residual": true, "num_convs_per_block": 2, "num_blocks_per_res": 2, "downsample_factor": 2, "use_max_pool": false, "downsample_with_first_conv": true, "num_dense_layers": 1, "latent_features": 64, "kernel": 3, "features": 4, "max_features": 32, "norm_type": "batch", "min_res": 4, "lrelu_alpha": 0.2, "use_bias": false, "dropout": 0.3, "weight_reg_kind": "l2", "weight_reg_factor": 0}, "downsample": true, "features": 16, "last_features": 8}}, {"class_name": "ResBlock", "config": {"name": "res_block_5", "trainable": true, "batch_input_shape": [null, 250, 250, 8], "dtype": "float32", "conf": {"image_size": 1000, "percentage_train": 0.8, "max_elements": 9600, "period_to_save_cp": 5, "num_epochs_for_lin_regression": 40, "tot_num_epochs": 400, "batch_size": 50, "lr": 0.001, "train_loss_type": "MSE", "val_loss_type": "MSE", "rot_range": 0, "use_fft": false, "residual": true, "num_convs_per_block": 2, "num_blocks_per_res": 2, "downsample_factor": 2, "use_max_pool": false, "downsample_with_first_conv": true, "num_dense_layers": 1, "latent_features": 64, "kernel": 3, "features": 4, "max_features": 32, "norm_type": "batch", "min_res": 4, "lrelu_alpha": 0.2, "use_bias": false, "dropout": 0.3, "weight_reg_kind": "l2", "weight_reg_factor": 0}, "downsample": false, "features": 16, "last_features": 8}}, {"class_name": "Padder", "config": {"name": "padder", "trainable": true, "batch_input_shape": [null, 125, 125, 16], "dtype": "float32", "padding": 3}}, {"class_name": "ResBlock", "config": {"name": "res_block_6", "trainable": true, "batch_input_shape": [null, 128, 128, 16], "dtype": "float32", "conf": {"image_size": 1000, "percentage_train": 0.8, "max_elements": 9600, "period_to_save_cp": 5, "num_epochs_for_lin_regression": 40, "tot_num_epochs": 400, "batch_size": 50, "lr": 0.001, "train_loss_type": "MSE", "val_loss_type": "MSE", "rot_range": 0, "use_fft": false, "residual": true, "num_convs_per_block": 2, "num_blocks_per_res": 2, "downsample_factor": 2, "use_max_pool": false, "downsample_with_first_conv": true, "num_dense_layers": 1, "latent_features": 64, "kernel": 3, "features": 4, "max_features": 32, "norm_type": "batch", "min_res": 4, "lrelu_alpha": 0.2, "use_bias": false, "dropout": 0.3, "weight_reg_kind": "l2", "weight_reg_factor": 0}, "downsample": true, "features": 32, "last_features": 16}}, {"class_name": "ResBlock", "config": {"name": "res_block_7", "trainable": true, "batch_input_shape": [null, 128, 128, 16], "dtype": "float32", "conf": {"image_size": 1000, "percentage_train": 0.8, "max_elements": 9600, "period_to_save_cp": 5, "num_epochs_for_lin_regression": 40, "tot_num_epochs": 400, "batch_size": 50, "lr": 0.001, "train_loss_type": "MSE", "val_loss_type": "MSE", "rot_range": 0, "use_fft": false, "residual": true, "num_convs_per_block": 2, "num_blocks_per_res": 2, "downsample_factor": 2, "use_max_pool": false, "downsample_with_first_conv": true, "num_dense_layers": 1, "latent_features": 64, "kernel": 3, "features": 4, "max_features": 32, "norm_type": "batch", "min_res": 4, "lrelu_alpha": 0.2, "use_bias": false, "dropout": 0.3, "weight_reg_kind": "l2", "weight_reg_factor": 0}, "downsample": false, "features": 32, "last_features": 16}}, {"class_name": "ResBlock", "config": {"name": "res_block_8", "trainable": true, "batch_input_shape": [null, 64, 64, 32], "dtype": "float32", "conf": {"image_size": 1000, "percentage_train": 0.8, "max_elements": 9600, "period_to_save_cp": 5, "num_epochs_for_lin_regression": 40, "tot_num_epochs": 400, "batch_size": 50, "lr": 0.001, "train_loss_type": "MSE", "val_loss_type": "MSE", "rot_range": 0, "use_fft": false, "residual": true, "num_convs_per_block": 2, "num_blocks_per_res": 2, "downsample_factor": 2, "use_max_pool": false, "downsample_with_first_conv": true, "num_dense_layers": 1, "latent_features": 64, "kernel": 3, "features": 4, "max_features": 32, "norm_type": "batch", "min_res": 4, "lrelu_alpha": 0.2, "use_bias": false, "dropout": 0.3, "weight_reg_kind": "l2", "weight_reg_factor": 0}, "downsample": true, "features": 32, "last_features": 32}}, {"class_name": "ResBlock", "config": {"name": "res_block_9", "trainable": true, "batch_input_shape": [null, 64, 64, 32], "dtype": "float32", "conf": {"image_size": 1000, "percentage_train": 0.8, "max_elements": 9600, "period_to_save_cp": 5, "num_epochs_for_lin_regression": 40, "tot_num_epochs": 400, "batch_size": 50, "lr": 0.001, "train_loss_type": "MSE", "val_loss_type": "MSE", "rot_range": 0, "use_fft": false, "residual": true, "num_convs_per_block": 2, "num_blocks_per_res": 2, "downsample_factor": 2, "use_max_pool": false, "downsample_with_first_conv": true, "num_dense_layers": 1, "latent_features": 64, "kernel": 3, "features": 4, "max_features": 32, "norm_type": "batch", "min_res": 4, "lrelu_alpha": 0.2, "use_bias": false, "dropout": 0.3, "weight_reg_kind": "l2", "weight_reg_factor": 0}, "downsample": false, "features": 32, "last_features": 32}}, {"class_name": "ResBlock", "config": {"name": "res_block_10", "trainable": true, "batch_input_shape": [null, 32, 32, 32], "dtype": "float32", "conf": {"image_size": 1000, "percentage_train": 0.8, "max_elements": 9600, "period_to_save_cp": 5, "num_epochs_for_lin_regression": 40, "tot_num_epochs": 400, "batch_size": 50, "lr": 0.001, "train_loss_type": "MSE", "val_loss_type": "MSE", "rot_range": 0, "use_fft": false, "residual": true, "num_convs_per_block": 2, "num_blocks_per_res": 2, "downsample_factor": 2, "use_max_pool": false, "downsample_with_first_conv": true, "num_dense_layers": 1, "latent_features": 64, "kernel": 3, "features": 4, "max_features": 32, "norm_type": "batch", "min_res": 4, "lrelu_alpha": 0.2, "use_bias": false, "dropout": 0.3, "weight_reg_kind": "l2", "weight_reg_factor": 0}, "downsample": true, "features": 32, "last_features": 32}}, {"class_name": "ResBlock", "config": {"name": "res_block_11", "trainable": true, "batch_input_shape": [null, 32, 32, 32], "dtype": "float32", "conf": {"image_size": 1000, "percentage_train": 0.8, "max_elements": 9600, "period_to_save_cp": 5, "num_epochs_for_lin_regression": 40, "tot_num_epochs": 400, "batch_size": 50, "lr": 0.001, "train_loss_type": "MSE", "val_loss_type": "MSE", "rot_range": 0, "use_fft": false, "residual": true, "num_convs_per_block": 2, "num_blocks_per_res": 2, "downsample_factor": 2, "use_max_pool": false, "downsample_with_first_conv": true, "num_dense_layers": 1, "latent_features": 64, "kernel": 3, "features": 4, "max_features": 32, "norm_type": "batch", "min_res": 4, "lrelu_alpha": 0.2, "use_bias": false, "dropout": 0.3, "weight_reg_kind": "l2", "weight_reg_factor": 0}, "downsample": false, "features": 32, "last_features": 32}}, {"class_name": "ResBlock", "config": {"name": "res_block_12", "trainable": true, "batch_input_shape": [null, 16, 16, 32], "dtype": "float32", "conf": {"image_size": 1000, "percentage_train": 0.8, "max_elements": 9600, "period_to_save_cp": 5, "num_epochs_for_lin_regression": 40, "tot_num_epochs": 400, "batch_size": 50, "lr": 0.001, "train_loss_type": "MSE", "val_loss_type": "MSE", "rot_range": 0, "use_fft": false, "residual": true, "num_convs_per_block": 2, "num_blocks_per_res": 2, "downsample_factor": 2, "use_max_pool": false, "downsample_with_first_conv": true, "num_dense_layers": 1, "latent_features": 64, "kernel": 3, "features": 4, "max_features": 32, "norm_type": "batch", "min_res": 4, "lrelu_alpha": 0.2, "use_bias": false, "dropout": 0.3, "weight_reg_kind": "l2", "weight_reg_factor": 0}, "downsample": true, "features": 32, "last_features": 32}}, {"class_name": "ResBlock", "config": {"name": "res_block_13", "trainable": true, "batch_input_shape": [null, 16, 16, 32], "dtype": "float32", "conf": {"image_size": 1000, "percentage_train": 0.8, "max_elements": 9600, "period_to_save_cp": 5, "num_epochs_for_lin_regression": 40, "tot_num_epochs": 400, "batch_size": 50, "lr": 0.001, "train_loss_type": "MSE", "val_loss_type": "MSE", "rot_range": 0, "use_fft": false, "residual": true, "num_convs_per_block": 2, "num_blocks_per_res": 2, "downsample_factor": 2, "use_max_pool": false, "downsample_with_first_conv": true, "num_dense_layers": 1, "latent_features": 64, "kernel": 3, "features": 4, "max_features": 32, "norm_type": "batch", "min_res": 4, "lrelu_alpha": 0.2, "use_bias": false, "dropout": 0.3, "weight_reg_kind": "l2", "weight_reg_factor": 0}, "downsample": false, "features": 32, "last_features": 32}}, {"class_name": "ResBlock", "config": {"name": "res_block_14", "trainable": true, "batch_input_shape": [null, 8, 8, 32], "dtype": "float32", "conf": {"image_size": 1000, "percentage_train": 0.8, "max_elements": 9600, "period_to_save_cp": 5, "num_epochs_for_lin_regression": 40, "tot_num_epochs": 400, "batch_size": 50, "lr": 0.001, "train_loss_type": "MSE", "val_loss_type": "MSE", "rot_range": 0, "use_fft": false, "residual": true, "num_convs_per_block": 2, "num_blocks_per_res": 2, "downsample_factor": 2, "use_max_pool": false, "downsample_with_first_conv": true, "num_dense_layers": 1, "latent_features": 64, "kernel": 3, "features": 4, "max_features": 32, "norm_type": "batch", "min_res": 4, "lrelu_alpha": 0.2, "use_bias": false, "dropout": 0.3, "weight_reg_kind": "l2", "weight_reg_factor": 0}, "downsample": true, "features": 32, "last_features": 32}}, {"class_name": "ResBlock", "config": {"name": "res_block_15", "trainable": true, "batch_input_shape": [null, 8, 8, 32], "dtype": "float32", "conf": {"image_size": 1000, "percentage_train": 0.8, "max_elements": 9600, "period_to_save_cp": 5, "num_epochs_for_lin_regression": 40, "tot_num_epochs": 400, "batch_size": 50, "lr": 0.001, "train_loss_type": "MSE", "val_loss_type": "MSE", "rot_range": 0, "use_fft": false, "residual": true, "num_convs_per_block": 2, "num_blocks_per_res": 2, "downsample_factor": 2, "use_max_pool": false, "downsample_with_first_conv": true, "num_dense_layers": 1, "latent_features": 64, "kernel": 3, "features": 4, "max_features": 32, "norm_type": "batch", "min_res": 4, "lrelu_alpha": 0.2, "use_bias": false, "dropout": 0.3, "weight_reg_kind": "l2", "weight_reg_factor": 0}, "downsample": false, "features": 32, "last_features": 32}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}