Model: "till_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
res_block (ResBlock)         (None, 500, 500, 4)       212       
_________________________________________________________________
res_block_1 (ResBlock)       (None, 500, 500, 4)       320       
_________________________________________________________________
res_block_2 (ResBlock)       (None, 250, 250, 8)       928       
_________________________________________________________________
res_block_3 (ResBlock)       (None, 250, 250, 8)       1216      
_________________________________________________________________
res_block_4 (ResBlock)       (None, 125, 125, 16)      3584      
_________________________________________________________________
res_block_5 (ResBlock)       (None, 125, 125, 16)      4736      
_________________________________________________________________
padder (Padder)              (None, 128, 128, 16)      0         
_________________________________________________________________
res_block_6 (ResBlock)       (None, 64, 64, 32)        14080     
_________________________________________________________________
res_block_7 (ResBlock)       (None, 64, 64, 32)        18688     
_________________________________________________________________
res_block_8 (ResBlock)       (None, 32, 32, 32)        18688     
_________________________________________________________________
res_block_9 (ResBlock)       (None, 32, 32, 32)        18688     
_________________________________________________________________
res_block_10 (ResBlock)      (None, 16, 16, 32)        18688     
_________________________________________________________________
res_block_11 (ResBlock)      (None, 16, 16, 32)        18688     
_________________________________________________________________
res_block_12 (ResBlock)      (None, 8, 8, 32)          18688     
_________________________________________________________________
res_block_13 (ResBlock)      (None, 8, 8, 32)          18688     
_________________________________________________________________
res_block_14 (ResBlock)      (None, 4, 4, 32)          18688     
_________________________________________________________________
res_block_15 (ResBlock)      (None, 4, 4, 32)          18688     
_________________________________________________________________
flatten (Flatten)            (None, 512)               0         
_________________________________________________________________
dropout (Dropout)            (None, 512)               0         
_________________________________________________________________
dense (Dense)                (None, 1)                 512       
=================================================================
Total params: 193,780
Trainable params: 192,276
Non-trainable params: 1,504
_________________________________________________________________
