Model: "till_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
padder (Padder)              (None, 128, 128, 1)       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 64, 64, 4)         36        
_________________________________________________________________
factor_layer (FactorLayer)   (None, 64, 64, 4)         0         
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 64, 64, 4)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 64, 64, 4)         144       
_________________________________________________________________
factor_layer_1 (FactorLayer) (None, 64, 64, 4)         0         
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 64, 64, 4)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 64, 64, 4)         144       
_________________________________________________________________
factor_layer_2 (FactorLayer) (None, 64, 64, 4)         0         
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 64, 64, 4)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 32, 32, 8)         288       
_________________________________________________________________
factor_layer_3 (FactorLayer) (None, 32, 32, 8)         0         
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 32, 32, 8)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 32, 32, 8)         576       
_________________________________________________________________
factor_layer_4 (FactorLayer) (None, 32, 32, 8)         0         
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 32, 32, 8)         0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 32, 32, 8)         576       
_________________________________________________________________
factor_layer_5 (FactorLayer) (None, 32, 32, 8)         0         
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 32, 32, 8)         0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 16, 16, 16)        1152      
_________________________________________________________________
factor_layer_6 (FactorLayer) (None, 16, 16, 16)        0         
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 16, 16, 16)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 16, 16, 16)        2304      
_________________________________________________________________
factor_layer_7 (FactorLayer) (None, 16, 16, 16)        0         
_________________________________________________________________
leaky_re_lu_7 (LeakyReLU)    (None, 16, 16, 16)        0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 16, 16, 16)        2304      
_________________________________________________________________
factor_layer_8 (FactorLayer) (None, 16, 16, 16)        0         
_________________________________________________________________
leaky_re_lu_8 (LeakyReLU)    (None, 16, 16, 16)        0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 8, 8, 32)          4608      
_________________________________________________________________
factor_layer_9 (FactorLayer) (None, 8, 8, 32)          0         
_________________________________________________________________
leaky_re_lu_9 (LeakyReLU)    (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 8, 8, 32)          9216      
_________________________________________________________________
factor_layer_10 (FactorLayer (None, 8, 8, 32)          0         
_________________________________________________________________
leaky_re_lu_10 (LeakyReLU)   (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 8, 8, 32)          9216      
_________________________________________________________________
factor_layer_11 (FactorLayer (None, 8, 8, 32)          0         
_________________________________________________________________
leaky_re_lu_11 (LeakyReLU)   (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 4, 4, 32)          9216      
_________________________________________________________________
factor_layer_12 (FactorLayer (None, 4, 4, 32)          0         
_________________________________________________________________
leaky_re_lu_12 (LeakyReLU)   (None, 4, 4, 32)          0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 4, 4, 32)          9216      
_________________________________________________________________
factor_layer_13 (FactorLayer (None, 4, 4, 32)          0         
_________________________________________________________________
leaky_re_lu_13 (LeakyReLU)   (None, 4, 4, 32)          0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 4, 4, 32)          9216      
_________________________________________________________________
factor_layer_14 (FactorLayer (None, 4, 4, 32)          0         
_________________________________________________________________
leaky_re_lu_14 (LeakyReLU)   (None, 4, 4, 32)          0         
_________________________________________________________________
flatten (Flatten)            (None, 512)               0         
_________________________________________________________________
dense (Dense)                (None, 32)                16384     
_________________________________________________________________
factor_layer_15 (FactorLayer (None, 32)                0         
_________________________________________________________________
leaky_re_lu_15 (LeakyReLU)   (None, 32)                0         
_________________________________________________________________
dropout (Dropout)            (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 32        
_________________________________________________________________
sigmoid_layer (SigmoidLayer) (None, 1)                 0         
_________________________________________________________________
factor_layer_16 (FactorLayer (None, 1)                 0         
=================================================================
Total params: 74,628
Trainable params: 74,628
Non-trainable params: 0
_________________________________________________________________
