Model: "till_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 500, 500, 16)      144       
_________________________________________________________________
batch_normalization_v2 (Batc (None, 500, 500, 16)      64        
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 500, 500, 16)      0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 250, 250, 32)      4608      
_________________________________________________________________
batch_normalization_v2_1 (Ba (None, 250, 250, 32)      128       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 250, 250, 32)      0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 125, 125, 64)      18432     
_________________________________________________________________
batch_normalization_v2_2 (Ba (None, 125, 125, 64)      256       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 125, 125, 64)      0         
_________________________________________________________________
padder (Padder)              (None, 128, 128, 64)      0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 64, 64, 128)       73728     
_________________________________________________________________
batch_normalization_v2_3 (Ba (None, 64, 64, 128)       512       
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 64, 64, 128)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 32, 32, 128)       147456    
_________________________________________________________________
batch_normalization_v2_4 (Ba (None, 32, 32, 128)       512       
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 32, 32, 128)       0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 16, 16, 128)       147456    
_________________________________________________________________
batch_normalization_v2_5 (Ba (None, 16, 16, 128)       512       
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 8, 8, 128)         147456    
_________________________________________________________________
batch_normalization_v2_6 (Ba (None, 8, 8, 128)         512       
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 4, 4, 128)         147456    
_________________________________________________________________
batch_normalization_v2_7 (Ba (None, 4, 4, 128)         512       
_________________________________________________________________
leaky_re_lu_7 (LeakyReLU)    (None, 4, 4, 128)         0         
_________________________________________________________________
flatten (Flatten)            (None, 2048)              0         
_________________________________________________________________
dense (Dense)                (None, 1)                 2049      
_________________________________________________________________
sigmoid_layer (SigmoidLayer) (None, 1)                 0         
_________________________________________________________________
factor_layer (FactorLayer)   (None, 1)                 0         
=================================================================
Total params: 691,793
Trainable params: 690,289
Non-trainable params: 1,504
_________________________________________________________________
