Model: "till_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 1000, 1000, 8)     72        
_________________________________________________________________
batch_normalization_v2 (Batc (None, 1000, 1000, 8)     32        
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 1000, 1000, 8)     0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 500, 500, 8)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 500, 500, 8)       576       
_________________________________________________________________
batch_normalization_v2_1 (Ba (None, 500, 500, 8)       32        
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 500, 500, 8)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 500, 500, 8)       576       
_________________________________________________________________
batch_normalization_v2_2 (Ba (None, 500, 500, 8)       32        
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 500, 500, 8)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 500, 500, 16)      1152      
_________________________________________________________________
batch_normalization_v2_3 (Ba (None, 500, 500, 16)      64        
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 500, 500, 16)      0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 250, 250, 16)      0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 250, 250, 16)      2304      
_________________________________________________________________
batch_normalization_v2_4 (Ba (None, 250, 250, 16)      64        
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 250, 250, 16)      0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 250, 250, 16)      2304      
_________________________________________________________________
batch_normalization_v2_5 (Ba (None, 250, 250, 16)      64        
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 250, 250, 16)      0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 250, 250, 32)      4608      
_________________________________________________________________
batch_normalization_v2_6 (Ba (None, 250, 250, 32)      128       
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 250, 250, 32)      0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 125, 125, 32)      0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 125, 125, 32)      9216      
_________________________________________________________________
batch_normalization_v2_7 (Ba (None, 125, 125, 32)      128       
_________________________________________________________________
leaky_re_lu_7 (LeakyReLU)    (None, 125, 125, 32)      0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 125, 125, 32)      9216      
_________________________________________________________________
batch_normalization_v2_8 (Ba (None, 125, 125, 32)      128       
_________________________________________________________________
leaky_re_lu_8 (LeakyReLU)    (None, 125, 125, 32)      0         
_________________________________________________________________
padder (Padder)              (None, 128, 128, 32)      0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 128, 128, 64)      18432     
_________________________________________________________________
batch_normalization_v2_9 (Ba (None, 128, 128, 64)      256       
_________________________________________________________________
leaky_re_lu_9 (LeakyReLU)    (None, 128, 128, 64)      0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 64, 64, 64)        0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 64, 64, 64)        36864     
_________________________________________________________________
batch_normalization_v2_10 (B (None, 64, 64, 64)        256       
_________________________________________________________________
leaky_re_lu_10 (LeakyReLU)   (None, 64, 64, 64)        0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 64, 64, 64)        36864     
_________________________________________________________________
batch_normalization_v2_11 (B (None, 64, 64, 64)        256       
_________________________________________________________________
leaky_re_lu_11 (LeakyReLU)   (None, 64, 64, 64)        0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 64, 64, 64)        36864     
_________________________________________________________________
batch_normalization_v2_12 (B (None, 64, 64, 64)        256       
_________________________________________________________________
leaky_re_lu_12 (LeakyReLU)   (None, 64, 64, 64)        0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 32, 32, 64)        36864     
_________________________________________________________________
batch_normalization_v2_13 (B (None, 32, 32, 64)        256       
_________________________________________________________________
leaky_re_lu_13 (LeakyReLU)   (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 32, 32, 64)        36864     
_________________________________________________________________
batch_normalization_v2_14 (B (None, 32, 32, 64)        256       
_________________________________________________________________
leaky_re_lu_14 (LeakyReLU)   (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 32, 32, 64)        36864     
_________________________________________________________________
batch_normalization_v2_15 (B (None, 32, 32, 64)        256       
_________________________________________________________________
leaky_re_lu_15 (LeakyReLU)   (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 16, 16, 64)        36864     
_________________________________________________________________
batch_normalization_v2_16 (B (None, 16, 16, 64)        256       
_________________________________________________________________
leaky_re_lu_16 (LeakyReLU)   (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 16, 16, 64)        36864     
_________________________________________________________________
batch_normalization_v2_17 (B (None, 16, 16, 64)        256       
_________________________________________________________________
leaky_re_lu_17 (LeakyReLU)   (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 16, 16, 64)        36864     
_________________________________________________________________
batch_normalization_v2_18 (B (None, 16, 16, 64)        256       
_________________________________________________________________
leaky_re_lu_18 (LeakyReLU)   (None, 16, 16, 64)        0         
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 8, 8, 64)          36864     
_________________________________________________________________
batch_normalization_v2_19 (B (None, 8, 8, 64)          256       
_________________________________________________________________
leaky_re_lu_19 (LeakyReLU)   (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 8, 8, 64)          36864     
_________________________________________________________________
batch_normalization_v2_20 (B (None, 8, 8, 64)          256       
_________________________________________________________________
leaky_re_lu_20 (LeakyReLU)   (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 8, 8, 64)          36864     
_________________________________________________________________
batch_normalization_v2_21 (B (None, 8, 8, 64)          256       
_________________________________________________________________
leaky_re_lu_21 (LeakyReLU)   (None, 8, 8, 64)          0         
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 4, 4, 64)          0         
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 4, 4, 64)          36864     
_________________________________________________________________
batch_normalization_v2_22 (B (None, 4, 4, 64)          256       
_________________________________________________________________
leaky_re_lu_22 (LeakyReLU)   (None, 4, 4, 64)          0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 4, 4, 64)          36864     
_________________________________________________________________
batch_normalization_v2_23 (B (None, 4, 4, 64)          256       
_________________________________________________________________
leaky_re_lu_23 (LeakyReLU)   (None, 4, 4, 64)          0         
_________________________________________________________________
flatten (Flatten)            (None, 1024)              0         
_________________________________________________________________
dense (Dense)                (None, 64)                65536     
_________________________________________________________________
batch_normalization_v2_24 (B (None, 64)                256       
_________________________________________________________________
leaky_re_lu_24 (LeakyReLU)   (None, 64)                0         
_________________________________________________________________
dropout (Dropout)            (None, 64)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 64        
=================================================================
Total params: 634,920
Trainable params: 632,536
Non-trainable params: 2,384
_________________________________________________________________
