Model: "till_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
padder (Padder)              (None, 128, 128, 1)       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 32, 32, 4)         36        
_________________________________________________________________
batch_normalization_v2 (Batc (None, 32, 32, 4)         16        
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 32, 32, 4)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 8, 8, 8)           288       
_________________________________________________________________
batch_normalization_v2_1 (Ba (None, 8, 8, 8)           32        
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 8, 8, 8)           0         
_________________________________________________________________
flatten (Flatten)            (None, 512)               0         
_________________________________________________________________
dense (Dense)                (None, 16)                8192      
_________________________________________________________________
batch_normalization_v2_2 (Ba (None, 16)                64        
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 16)                0         
_________________________________________________________________
dropout (Dropout)            (None, 16)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 16        
_________________________________________________________________
sigmoid_layer (SigmoidLayer) (None, 1)                 0         
_________________________________________________________________
factor_layer (FactorLayer)   (None, 1)                 0         
=================================================================
Total params: 8,644
Trainable params: 8,588
Non-trainable params: 56
_________________________________________________________________
